Rails/app/controllers/api/v1/devices_controller.rb

			def index
				respond_with Device.all
---
SELECT "devices".* FROM "devices"

			def show
				respond_with Device.find(params[:id])
---
SELECT  "devices".* FROM "devices"  WHERE "devices"."id" = ? LIMIT 1  [["id", 1]]

			def test
				logger.info "This is a test "+ params.inspect
				@str = params[:regId]
				#str = "APA91bH4RfAR45WvoV0-Zvjot7Czha1UwyCLkjnB7CtDhhH-XHuLUOEnJ5qL9KpN1H0BVSnWG-DNjlM3ZAnOcAvFqaM0qyCCSRheaNOppuj5WIO-9l7OB-UDb4LDFo7V6jSs-Uc7fwYZCWGEAgKD4kew1Y60aCV5Ww"
				@d = Device.where(regid: @str).first
				@d ||= Device.create(regid: @str)
---
SELECT  "devices".* FROM "devices"  WHERE "devices"."regid" = 'APA91bH4RfAR45WvoV0-Zvjot7Czha1UwyCLkjnB7CtDhhH-XHuLUOEnJ5qL9KpN1H0BVSnWG-DNjlM3ZAnOcAvFqaM0qyCCSRheaNOppuj5WIO-9l7OB-UDb4LDFo7V6jSs-Uc7fwYZCWGEAgKD4kew1Y60aCV5Ww'  ORDER BY "devices"."id" ASC LIMIT 1
INSERT INTO "devices" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-03-23 04:59:30.340884"], ["updated_at", "2014-03-23 04:59:30.340884"]]